#include <stdio.h>
// 주석(추가 설명을 위한 포스트잇)
// 주석을 다는 방법은 두 가지가 있다.
// 1. //을 붙이면 한 줄 주석
/* 2. 열고 닫으면 그 사이는 전부 주석
	  여기
	  이렇게
	  모두 주석 처리 */
// #include는 필요한 라이브러리를 가져올 때 사용
// 라이브러리는 도서관, 필요한 정보를 가져올 때 사용하는 것
// 'stdio.h' 확장자가 .h인 파일을 헤더 파일이라고 함
// 입출려과 관련된 내용들을 다룸.
// 입력 : 키보드, 출력 : 모니터

// main()은 함수인데 당장은 몰라도 됨.
/* C 프로그래밍 기본 포맷

int main(void)
{
	return 0;
	}
*/

int main()
{
	// print는 출력한다.
	// printf는 print format의 약자
	// 문자열(문자들의 나열)을 표현할 때는 무조건 쌍따옴표를 사용.
	printf("Hello Wolrd");

	return 0;
}


